In [1]:
#import some necessary librairies

import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

color = sns.color_palette()
sns.set_style('darkgrid')

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.float_format', lambda x: '{:.2f}'.format(x)) #Limiting floats output to 3 decimal points
os.getcwd()

'C:\\Users\\sohai\\Desktop\\My Personal\\0. Kaggle'

In [2]:
#Change the working directory
%cd "C:\\Users\\sohai\\Desktop\\My Personal\\0. Kaggle"
print(os.listdir())

C:\Users\sohai\Desktop\My Personal\0. Kaggle
['.ipynb_checkpoints', 'cibil.csv', 'cibil_data_desc.xlsx', 'Credit Model Risk Analysis v2.pdf', 'Credit Model Risk Analysis.pdf', 'customer_data_for_credit_scoring.csv', 'df.xlsx', 'Doc.docx', 'final customer_data_for_credit_scoring.csv', 'Kaggle LendIt.ipynb', 'kek.xlsx', 'loan_type.csv', 'loan_type_enquiries.csv', 'member_enquiries.csv']

In [3]:
#Now let's import and put the train and test datasets in  pandas dataframe

data = pd.read_csv("final customer_data_for_credit_scoring.csv")
data.head(2)

,CIBIL score,Current Loan Delay,Current Loan tenure,Date_of_birth,Final status,First Loan,Funding amount,Funding date,Gender,Highest educational qualifications,Home ownership,Last Loan,Monthly salary,Product/loan type,Purpose of loan,Years Of Experience,user,Funded/Rejected
0,642,NaN,NaN,02-09-1993,NaN,NaN,0,NaN,male,GRADUATE,RENTED,NaN,19100.00,NaN,NaN,4.00,8,Rejected
1,540,1060days,24days,01-07-1987,DISBURSED,14-11-2017,786531,14-11-2017,male,GRADUATE,OWNED,19-12-2018,33000.00,Payday Loan,Persanal,9.00,11,Funded

In [4]:
cibil = pd.read_csv("cibil.csv")
cibil.head(2)

,accounts_summary__current_loan_balance,accounts_summary__first_loan_date,accounts_summary__last_loan_date,accounts_summary__overdue,accounts_summary__overdue_balance,accounts_summary__sanction_amount,accounts_summary__total_loan,accounts_summary__zero_balance,cibil_date,date_of_birth,enquiries__last_enquiry_date,enquiries__past_12_months,enquiries__past_24_months,enquiries__past_30_days,enquiries__total,gender,id,score,score_name,user
0,152480.00,19-04-2017,09-10-2019,0.00,0.00,509845.00,35.00,29.00,02-01-2020,18-04-1993,01-01-2020,34,18,13,65,MALE,49909,761,CREDITVISION® SCORE,532929.00
1,65159.00,07-05-2009,14-01-2021,2.00,10342.00,3613477.00,45.00,40.00,09-03-2021,01-06-1980,24-10-2020,9,22,0,56,MALE,49896,695,CREDITVISION® SCORE,324281.00

In [5]:
df = data.merge(cibil, on='user', how='left')
df.head(3)

,CIBIL score,Current Loan Delay,Current Loan tenure,Date_of_birth,Final status,First Loan,Funding amount,Funding date,Gender,Highest educational qualifications,...,date_of_birth,enquiries__last_enquiry_date,enquiries__past_12_months,enquiries__past_24_months,enquiries__past_30_days,enquiries__total,gender,id,score,score_name
0,642,NaN,NaN,02-09-1993,NaN,NaN,0,NaN,male,GRADUATE,...,02-09-1993,25-12-2019,23,39,5,122,MALE,73224,663,CREDITVISION® SCORE
1,540,1060days,24days,01-07-1987,DISBURSED,14-11-2017,786531,14-11-2017,male,GRADUATE,...,01-07-1987,11-06-2019,23,23,7,97,MALE,92236,540,PERSONAL LOAN SCORE
2,747,0days,25days,13-11-1993,FAILED,09-11-2017,352000,09-11-2017,male,POST_GRADUATE,...,13-11-1993,17-06-2021,38,16,0,120,MALE,103008,747,CREDITVISION® SCORE

In [6]:
df['Funded/Rejected'].value_counts()

Rejected    32647
Funded      32609
Name: Funded/Rejected, dtype: int64

In [7]:
data.shape

(65256, 18)

In [8]:
df.isnull().sum()

CIBIL score                                   0
Current Loan Delay                        19510
Current Loan tenure                       19510
Date_of_birth                               133
Final status                              20530
First Loan                                21166
Funding amount                                0
Funding date                              21166
Gender                                      125
Highest educational qualifications            0
Home ownership                                9
Last Loan                                 27270
Monthly salary                              940
Product/loan type                         19510
Purpose of loan                           19652
Years Of Experience                         147
user                                          0
Funded/Rejected                               0
accounts_summary__current_loan_balance      469
accounts_summary__first_loan_date          2668
accounts_summary__last_loan_date           2668
accounts_summary__overdue                   469
accounts_summary__overdue_balance           469
accounts_summary__sanction_amount           469
accounts_summary__total_loan                469
accounts_summary__zero_balance              469
cibil_date                                    0
date_of_birth                                 0
enquiries__last_enquiry_date                  0
enquiries__past_12_months                     0
enquiries__past_24_months                     0
enquiries__past_30_days                       0
enquiries__total                              0
gender                                        0
id                                            0
score                                         0
score_name                                    0
dtype: int64

In [9]:
display(data.shape)
display(cibil.shape)
display(df.shape)

(65256, 18)

(65278, 20)

(65256, 37)

In [10]:
df.columns

Index(['CIBIL score', 'Current Loan Delay', 'Current Loan tenure',
       'Date_of_birth', 'Final status', 'First Loan', 'Funding amount',
       'Funding date', 'Gender', 'Highest educational qualifications',
       'Home ownership', 'Last Loan', 'Monthly salary', 'Product/loan type',
       'Purpose of loan', 'Years Of Experience', 'user', 'Funded/Rejected',
       'accounts_summary__current_loan_balance',
       'accounts_summary__first_loan_date', 'accounts_summary__last_loan_date',
       'accounts_summary__overdue', 'accounts_summary__overdue_balance',
       'accounts_summary__sanction_amount', 'accounts_summary__total_loan',
       'accounts_summary__zero_balance', 'cibil_date', 'date_of_birth',
       'enquiries__last_enquiry_date', 'enquiries__past_12_months',
       'enquiries__past_24_months', 'enquiries__past_30_days',
       'enquiries__total', 'gender', 'id', 'score', 'score_name'],
      dtype='object')

## 1. Data Pre-processing

There are some variables repeating in df like date of birth, cibil, loan date etc. Let's delete the duplicate variables 1st

In [11]:
df = df.drop(['accounts_summary__first_loan_date', 'accounts_summary__last_loan_date', 'cibil_date', 'date_of_birth',
       'gender', 'id', 'score', 'score_name'], axis=1)

df.columns

Index(['CIBIL score', 'Current Loan Delay', 'Current Loan tenure',
       'Date_of_birth', 'Final status', 'First Loan', 'Funding amount',
       'Funding date', 'Gender', 'Highest educational qualifications',
       'Home ownership', 'Last Loan', 'Monthly salary', 'Product/loan type',
       'Purpose of loan', 'Years Of Experience', 'user', 'Funded/Rejected',
       'accounts_summary__current_loan_balance', 'accounts_summary__overdue',
       'accounts_summary__overdue_balance',
       'accounts_summary__sanction_amount', 'accounts_summary__total_loan',
       'accounts_summary__zero_balance', 'enquiries__last_enquiry_date',
       'enquiries__past_12_months', 'enquiries__past_24_months',
       'enquiries__past_30_days', 'enquiries__total'],
      dtype='object')

#### 1.1 CIBIL Score

CIBIL score -1 means its new to the bank user with no credit history. Min value of CIBIL should be 350. 0,1, etc are erroneous values. We would replace these values with -1 as well. CIBIL score lies between 300-900.

In [12]:
df['CIBIL score'].describe()

count   65256.00
mean      676.02
std       134.97
min        -1.00
25%       666.00
50%       701.00
75%       736.00
max       861.00
Name: CIBIL score, dtype: float64

In [13]:
pd.Series(df['CIBIL score'].unique()).nsmallest(10)

93      -1
176      0
228      1
317      2
218      3
365      5
374    451
373    452
366    454
347    456
dtype: int64

In [14]:
#Replace CIBIL values less than 300 with -1
df['CIBIL score'] = np.where((df['CIBIL score'] < 300), -1, df['CIBIL score'])
pd.Series(df['CIBIL score'].unique()).nsmallest(5)

93      -1
369    451
368    452
361    454
343    456
dtype: int64

#### 1.2 Current Loan Delay & Current Loan Tenure

We have to remove the text and convert this variable into numeric values.

\D matches any non-digit character so, the code above, is essentially replacing every non-digit character for the empty string.

In [15]:
import re
string = "-22days"
string = re.sub('\D', '', string)
display(string)
display(type(string))
string = int(string)
display(type(string))

'22'

str

int

In [16]:
import re
string = "-22days"
string = string.replace('days', '')
display(string)
display(type(string))
string = int(string)
display(type(string))
display(string)


#loan_data['emp_length_int'] = loan_data['emp_length_int'].str.replace(' year', '')

'-22'

str

int

-22

In [17]:
df['Current Loan Delay'].value_counts()

0days       18218
1days        1502
-26days       953
-2days        734
-25days       655
            ...
1460days        1
1222days        1
1376days        1
680days         1
1024days        1
Name: Current Loan Delay, Length: 922, dtype: int64

In [18]:
df['Current Loan Delay'] = df['Current Loan Delay'].str.replace('days', '')
df['Current Loan Delay'] = pd.to_numeric(df['Current Loan Delay'])
df['Current Loan Delay'].describe()

count   45746.00
mean      118.07
std       227.54
min       -41.00
25%         0.00
50%         0.00
75%       126.00
max      1498.00
Name: Current Loan Delay, dtype: float64

In [19]:
# Looks like Years of Experience is 
pd.Series(df['Current Loan Delay'].unique()).nsmallest(10)

730   -41.00
922   -40.00
918   -39.00
653   -38.00
445   -37.00
739   -36.00
205   -35.00
540   -34.00
635   -33.00
325   -32.00
dtype: float64

In [20]:
df['Current Loan tenure'].value_counts()

29days     4349
30days     4036
31days     3361
28days     2949
27days     1940
           ...
349days       1
208days       1
355days       1
209days       1
60days        1
Name: Current Loan tenure, Length: 147, dtype: int64

In [21]:
df['Current Loan tenure'] = df['Current Loan tenure'].str.replace('days', '')
df['Current Loan tenure'] = pd.to_numeric(df['Current Loan tenure'])
df['Current Loan tenure'].describe()

count   45746.00
mean       39.68
std        31.24
min         0.00
25%        26.00
50%        30.00
75%        38.00
max      1107.00
Name: Current Loan tenure, dtype: float64

#### 1.3 Date of Birth

In [22]:
df['Date_of_birth'] = df['Date_of_birth'].apply(pd.to_datetime)

df['Year'] = df['Date_of_birth'].dt.year
df['Year'].describe()

count   65123.00
mean     1988.58
std         6.35
min      1945.00
25%      1985.00
50%      1990.00
75%      1993.00
max      2023.00
Name: Year, dtype: float64

There are some customers with with date of birth in 2023, 2021 etc, it seems counter-intuitive. May be data is erroneous. Need to dig more

There are 165 customers with age less than 21. We either need to delete these cases or replace them with mean age. Let's replace age of these customers with mean age

In [23]:
#165 customers have age less than 18 or are born after 2000. 
display(len(df[df['Year'] > 2000]))

#Replacing them with medain age
df['Year'] = np.where((df['Year'] > 2000), int(df['Year'].median().round()), df['Year'])

df['Year'].describe()

165

count   65123.00
mean     1988.55
std         6.31
min      1945.00
25%      1985.00
50%      1990.00
75%      1993.00
max      2000.00
Name: Year, dtype: float64

In [24]:
pd.Series(df['Year'].unique()).nlargest(10)

45   2000.00
41   1999.00
36   1998.00
20   1997.00
25   1996.00
15   1995.00
21   1994.00
0    1993.00
12   1992.00
8    1991.00
dtype: float64

In [25]:
xx= 2021

df['customer_age'] = xx - df['Year']
#df = df.drop(['Date_of_birth', 'Year'], axis=1)

display(df['customer_age'].describe())

count   65123.00
mean       32.45
std         6.31
min        21.00
25%        28.00
50%        31.00
75%        36.00
max        76.00
Name: customer_age, dtype: float64

#### 1.4 Final Status

In [26]:
df['Final status'].value_counts()

DISBURSED         16564
PAID              14422
FAILED             6897
SETTLED            6012
BALANCE_AMOUNT      791
PASSED               39
EXTENDED              1
Name: Final status, dtype: int64

#### 1.5 First Loan, Funded/Rejected Status
We take a reference date as December 2021. THen subtract first loan date from this reference to get number of days. Then convert this number of days into months and round it off to nearest month value. We call this date as mths_since_first_loan.

In [27]:
df['First Loan'].value_counts()

27-11-2019    484
07-11-2019    411
26-02-2020    305
15-02-2020    284
29-11-2019    275
             ...
15-05-2017      1
20-07-2020      1
30-10-2020      1
04-12-2017      1
15-04-2020      1
Name: First Loan, Length: 1166, dtype: int64

In [28]:
# COnverting earliest_cr_line from string type into mmm-yy date format and saving it into a variable
df['First Loan'] = pd.to_datetime(df['First Loan'], format= '%d-%m-%Y')
pd.to_datetime('2021-12-15')- df['First Loan']

0             NaT
1       1492 days
2       1497 days
3             NaT
4       1476 days
           ...
65251         NaT
65252         NaT
65253         NaT
65254     11 days
65255         NaT
Name: First Loan, Length: 65256, dtype: timedelta64[ns]

In [29]:
df['mths_since_first_loan'] = round((pd.to_datetime('2021-12-15')- df['First Loan'])/np.timedelta64(1, 'M'))

df['mths_since_first_loan'].describe()

count   44090.00
mean       22.32
std         9.70
min         0.00
25%        21.00
50%        25.00
75%        28.00
max        55.00
Name: mths_since_first_loan, dtype: float64

In [30]:
df['Funded/Rejected'].value_counts()

Rejected    32647
Funded      32609
Name: Funded/Rejected, dtype: int64

#### 1.6 Gender
We might have to put other category into male category as well later on. Other has quite small count and might be a nuisance.

In [31]:
df['Gender'].value_counts()

male      58357
female     6671
MALE         36
Male         33
other        18
Female        9
FEMALE        4
MALe          3
Name: Gender, dtype: int64

In [32]:
df['Gender'] = df['Gender'].str.lower()
df['Gender'] = df['Gender'].str.strip()
df['Gender'].value_counts()

male      58429
female     6684
other        18
Name: Gender, dtype: int64

In [33]:
df['Highest educational qualifications'].value_counts()

GRADUATE          28478
UNDER_GRADUATE    27635
POST_GRADUATE      9143
Name: Highest educational qualifications, dtype: int64

In [34]:
df['Home ownership'].value_counts()

OWNED     54483
RENTED    10764
Name: Home ownership, dtype: int64

#### 1.7 Last Loan
We take a reference date as December 2021. THen subtract last loan date from this reference to get number of days. Then convert this number of days into months and round it off to nearest month value. We call this date as mths_since_earliest_cr_line.

In [35]:
df['Last Loan']

0               NaN
1        19-12-2018
2               NaN
3        29-07-2019
4        04-10-2021
            ...
65251           NaN
65252           NaN
65253           NaN
65254    04-12-2021
65255           NaN
Name: Last Loan, Length: 65256, dtype: object

In [36]:
# COnverting earliest_cr_line from string type into mmm-yy date format and saving it into a variable
df['Last Loan'] = pd.to_datetime(df['Last Loan'], format= '%d-%m-%Y')

df['mths_since_last_loan'] = round((pd.to_datetime('2021-12-15')- df['Last Loan'])/np.timedelta64(1, 'M'))

df['mths_since_last_loan'].describe()

count   37986.00
mean       14.12
std        10.44
min         0.00
25%         2.00
50%        18.00
75%        23.00
max        51.00
Name: mths_since_last_loan, dtype: float64

Since data is pulled on 4th Dec. We delete all cases that are funded after 30th Sep 2021. We would have final actual status of most of the cases in the month of December that were funded before October.

In [37]:
df[['mths_since_last_loan', 'Last Loan']]

       mths_since_last_loan  Last Loan
0                       nan        NaT
1                     36.00 2018-12-19
2                       nan        NaT
3                     29.00 2019-07-29
4                      2.00 2021-10-04
...                     ...        ...
65251                   nan        NaT
65252                   nan        NaT
65253                   nan        NaT
65254                  0.00 2021-12-04
65255                   nan        NaT

[65256 rows x 2 columns]

#### 1.8 Monthly Salary
If salary is lesser than 10k, we replace it to zero

In [38]:
df['Monthly salary'].describe()

count      64316.00
mean       32834.62
std       192053.20
min            1.00
25%        18149.50
50%        24800.00
75%        35415.25
max     28200893.00
Name: Monthly salary, dtype: float64

In [39]:
# Looks like Years of Experience is 
pd.Series(df['Monthly salary'].unique()).nsmallest(10)

22336    1.00
21443    2.00
22328    5.00
21960    6.00
4394    10.00
21244   12.00
2634    19.00
5240    20.00
4634    21.00
7376    22.00
dtype: float64

In [40]:
len(df[df['Monthly salary']<10000])

229

In [41]:
df['Monthly salary'] = np.where((df['Monthly salary'] < 10000), 0, df['Monthly salary'])
df['Monthly salary'].describe()

count      64316.00
mean       32810.30
std       192056.82
min            0.00
25%        18149.50
50%        24800.00
75%        35415.25
max     28200893.00
Name: Monthly salary, dtype: float64

In [42]:
df['Product/loan type'].value_counts()

Payday Loan             38547
EMI Loan For 3 Month     6592
EMI Loan For 6            563
EMI Loan For 12            33
EMI Loan For 24             4
EMI Loan For 36             3
EMI Loan For 9              3
EMI Loan For 18             1
Name: Product/loan type, dtype: int64

In [43]:
#almost 70% of the loans by amount are from PayDay loan
loan_sum = df.groupby(['Product/loan type'])['Funding amount'].sum()

display(loan_sum)

loan_count = df.groupby(['Product/loan type'])['Funding amount'].count()

display(loan_count)


display((loan_sum/df['Funding amount'].sum())*100)

Product/loan type
EMI Loan For 12           10334058
EMI Loan For 18             247000
EMI Loan For 24            1560000
EMI Loan For 3 Month     474586208
EMI Loan For 36            1090000
EMI Loan For 6            52399229
EMI Loan For 9              510031
Payday Loan             1273794061
Name: Funding amount, dtype: int64

Product/loan type
EMI Loan For 12            33
EMI Loan For 18             1
EMI Loan For 24             4
EMI Loan For 3 Month     6592
EMI Loan For 36             3
EMI Loan For 6            563
EMI Loan For 9              3
Payday Loan             38547
Name: Funding amount, dtype: int64

Product/loan type
EMI Loan For 12         0.57
EMI Loan For 18         0.01
EMI Loan For 24         0.09
EMI Loan For 3 Month   26.15
EMI Loan For 36         0.06
EMI Loan For 6          2.89
EMI Loan For 9          0.03
Payday Loan            70.20
Name: Funding amount, dtype: float64

In [44]:
# 1st 5 categories have 50% of the items
df['Purpose of loan'].value_counts(normalize=True)

Personal                        0.14
Medical                         0.12
Emergency expenses              0.12
Medical Emergencies             0.06
Other                           0.05
                                ...
Lunch with office tea boys      0.00
Prashan                         0.00
To adjust medical expenditure   0.00
Helth checkup                   0.00
Madikal                         0.00
Name: Purpose of loan, Length: 3943, dtype: float64

#### 1.9 Years of Experience
Years of experience is in thousands and in negative. It's erroneous. We would delete it.

In [45]:

df['Years Of Experience'].describe()

count   65109.00
mean        8.22
std        75.32
min        -3.00
25%         3.00
50%         6.00
75%        10.00
max      9000.00
Name: Years Of Experience, dtype: float64

In [46]:
# Looks like Years of Experience is 
pd.Series(df['Years Of Experience'].unique()).nlargest(10)

228   9000.00
185   8000.00
240   7819.00
237   5611.00
229   5000.00
241   3500.00
219   2060.00
239   2050.00
203   2019.00
212   2018.00
dtype: float64

In [47]:
df['accounts_summary__current_loan_balance'].describe()

count       64787.00
mean       618261.07
std       1673560.09
min      -6339930.00
25%         49628.00
50%        198576.00
75%        622561.00
max     247165115.00
Name: accounts_summary__current_loan_balance, dtype: float64

In [48]:
# 137 accounts with negative accounts summary loan balance
display(len(df[df['accounts_summary__current_loan_balance']<0]))

pd.Series(df['accounts_summary__current_loan_balance'].unique()).nsmallest(5)

137

35573   -6339930.00
53583   -2525897.00
16016    -797734.00
2947     -713660.00
33509    -691390.00
dtype: float64

In [49]:
df['accounts_summary__overdue'].value_counts()

0.00     34657
1.00     13938
2.00      6801
3.00      3739
4.00      2081
5.00      1258
6.00       784
7.00       528
8.00       325
9.00       215
10.00      137
11.00       82
12.00       64
13.00       48
14.00       28
16.00       18
18.00       16
15.00       15
17.00       13
19.00       10
20.00        9
21.00        4
22.00        4
23.00        2
24.00        2
26.00        2
37.00        1
33.00        1
27.00        1
30.00        1
43.00        1
35.00        1
39.00        1
Name: accounts_summary__overdue, dtype: int64

In [50]:
df['accounts_summary__overdue_balance'].describe()

count      64787.00
mean       31002.38
std       562009.56
min            0.00
25%            0.00
50%            0.00
75%        11454.00
max     95437227.00
Name: accounts_summary__overdue_balance, dtype: float64

In [51]:
#More than half of accounts have accounts summary overdue balance as zero
len(df[df['accounts_summary__overdue_balance']==0])

34657

In [52]:
df['accounts_summary__sanction_amount'].describe()

count       64787.00
mean      1360098.02
std       4164253.39
min             0.00
25%        143689.50
50%        489314.00
75%       1387839.50
max     660821835.00
Name: accounts_summary__sanction_amount, dtype: float64

In [53]:
len(df[df['accounts_summary__sanction_amount']==0])

2252

In [54]:
df['accounts_summary__total_loan'].value_counts()

4.00      2841
3.00      2829
2.00      2794
5.00      2730
1.00      2696
          ...
259.00       1
183.00       1
170.00       1
165.00       1
523.00       1
Name: accounts_summary__total_loan, Length: 189, dtype: int64

In [55]:
df['accounts_summary__zero_balance'].value_counts()

0.00      7558
1.00      5446
2.00      4511
3.00      4026
4.00      3491
          ...
190.00       1
127.00       1
182.00       1
223.00       1
135.00       1
Name: accounts_summary__zero_balance, Length: 170, dtype: int64

In [56]:
df['enquiries__last_enquiry_date']

0        25-12-2019
1        11-06-2019
2        17-06-2021
3        10-12-2020
4        21-09-2021
            ...
65251    01-12-2021
65252    28-09-2019
65253    29-11-2021
65254    15-11-2021
65255    03-12-2021
Name: enquiries__last_enquiry_date, Length: 65256, dtype: object

In [57]:
# Converting enquiries__last_enquiry_date from string type into d-m-y date format and saving it into a variable
df['enquiries__last_enquiry_date'] = pd.to_datetime(df['enquiries__last_enquiry_date'], format= '%d-%m-%Y')

df['mths_since_last_enquiry'] = round((pd.to_datetime('15-12-2021')- df['enquiries__last_enquiry_date'])/np.timedelta64(1, 'M'))

df['mths_since_last_enquiry'].describe()

count   65256.00
mean       20.64
std         9.36
min         0.00
25%        11.00
50%        23.00
75%        27.00
max       159.00
Name: mths_since_last_enquiry, dtype: float64

In [58]:
df['enquiries__past_12_months']

0        23
1        23
2        38
3         9
4        10
         ..
65251     4
65252     0
65253     0
65254     9
65255     0
Name: enquiries__past_12_months, Length: 65256, dtype: int64

In [59]:
df['enquiries__past_30_days'].describe()

count   65256.00
mean        4.44
std         4.20
min         0.00
25%         1.00
50%         3.00
75%         6.00
max        59.00
Name: enquiries__past_30_days, dtype: float64

### Comparing PayDay and EMI
Convert the product type into EMI and Payday.

In [60]:

#df['Binary_product'] = np.where((df['Product/loan type'] == 'Payday Loan'), 'Payday', 'EMI')
#df['Binary_product'].value_counts()

In [61]:


# Here we take PayDay & EMI binary. Cases with missing Product/Loan Type would go into PayDay. We'd delete them
df['Binary_product'] = np.where(df['Product/loan type'].isin(['EMI Loan For 3 Month', 'EMI Loan For 6',
                                    'EMI Loan For 12', 'EMI Loan For 24', 'EMI Loan For 36', 'EMI Loan For 9',
                                    'EMI Loan For 18']),'EMI', 'Payday')

df['Binary_product'].value_counts()

Payday    58057
EMI        7199
Name: Binary_product, dtype: int64

In [62]:
df['Product/loan type'].value_counts()

Payday Loan             38547
EMI Loan For 3 Month     6592
EMI Loan For 6            563
EMI Loan For 12            33
EMI Loan For 24             4
EMI Loan For 36             3
EMI Loan For 9              3
EMI Loan For 18             1
Name: Product/loan type, dtype: int64

In [63]:
display(df.groupby(['Binary_product'])['Funding amount'].mean())

display(df.groupby(['Binary_product'])['Funding amount'].median())

Binary_product
EMI      75111.34
Payday   21940.40
Name: Funding amount, dtype: float64

Binary_product
EMI       39352
Payday     6000
Name: Funding amount, dtype: int64

In [64]:
df['Final status'].value_counts()

DISBURSED         16564
PAID              14422
FAILED             6897
SETTLED            6012
BALANCE_AMOUNT      791
PASSED               39
EXTENDED              1
Name: Final status, dtype: int64

## Data Preparation

    1. We delete all the rows that have final status as failed
    2. We create separate dataset for rejected cases for reject inference
    3. We create separate dataset for EMI and PayDay Loans
    4. We delete all the funded cases in EMI Loans that are funded after 30th Sep 2021
    5. We delete all the funded cases in PayDay Loans that are funded after 30th Nov 2021

Since Final status with missing label is rejected cases and we have no way to figure out if these application for EMI or PayDay. We would use this rejected data for reject inference in both EMI and PayDay Loans

In [65]:
df1 = df[df['Final status'] != 'FAILED']
df_rejected = df1[df1['Final status'].isnull()].copy()
df1 = df1[~df1['Final status'].isnull()] # Deleting the Final Status having missing values

df_payday = df1[df1['Binary_product']== 'Payday']
df_EMI = df1[df1['Binary_product']== 'EMI']

In [71]:
display(df_payday.shape)
display(df_EMI.shape)
display(df_rejected.shape)

(30967, 35)

(6862, 35)

(20530, 35)

In [79]:
df_rejected.isnull().sum()

CIBIL score                                   0
Current Loan Delay                        19510
Current Loan tenure                       19510
Date_of_birth                               123
Final status                              20530
First Loan                                19560
Funding amount                                0
Funding date                              19560
Gender                                      107
Highest educational qualifications            0
Home ownership                                7
Last Loan                                 20530
Monthly salary                              518
Product/loan type                         19510
Purpose of loan                           19521
Years Of Experience                         127
user                                          0
Funded/Rejected                               0
accounts_summary__current_loan_balance      404
accounts_summary__overdue                   404
accounts_summary__overdue_balance           404
accounts_summary__sanction_amount           404
accounts_summary__total_loan                404
accounts_summary__zero_balance              404
enquiries__last_enquiry_date                  0
enquiries__past_12_months                     0
enquiries__past_24_months                     0
enquiries__past_30_days                       0
enquiries__total                              0
Year                                        123
customer_age                                123
mths_since_first_loan                     19560
mths_since_last_loan                      20530
mths_since_last_enquiry                       0
Binary_product                                0
dtype: int64

In [77]:
df_payday[df_payday['mths_since_first_loan']==0]

,CIBIL score,Current Loan Delay,Current Loan tenure,Date_of_birth,Final status,First Loan,Funding amount,Funding date,Gender,Highest educational qualifications,...,enquiries__past_12_months,enquiries__past_24_months,enquiries__past_30_days,enquiries__total,Year,customer_age,mths_since_first_loan,mths_since_last_loan,mths_since_last_enquiry,Binary_product
11699,740,-31.00,34.00,1992-12-03,DISBURSED,2021-12-04,5000,04-12-2021,male,UNDER_GRADUATE,...,20,16,5,77,1992.00,29.00,0.00,0.00,1.00,Payday
12800,686,-25.00,29.00,1985-04-17,DISBURSED,2021-12-03,8000,03-12-2021,male,UNDER_GRADUATE,...,10,18,6,118,1985.00,36.00,0.00,0.00,0.00,Payday
15734,699,-25.00,31.00,1998-09-25,DISBURSED,2021-12-01,7000,01-12-2021,male,UNDER_GRADUATE,...,13,4,18,35,1998.00,23.00,0.00,0.00,0.00,Payday
42112,786,-35.00,40.00,1991-08-21,DISBURSED,2021-12-02,9000,02-12-2021,female,GRADUATE,...,4,0,4,9,1991.00,30.00,0.00,0.00,24.00,Payday
43450,743,-31.00,38.00,1992-03-12,DISBURSED,2021-11-30,8000,30-11-2021,male,GRADUATE,...,1,3,1,10,1992.00,29.00,0.00,0.00,23.00,Payday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65077,731,-25.00,28.00,1996-12-08,DISBURSED,2021-12-04,3000,04-12-2021,male,UNDER_GRADUATE,...,5,7,3,10,1996.00,25.00,0.00,0.00,1.00,Payday
65124,738,-31.00,34.00,1990-03-27,DISBURSED,2021-12-04,10000,04-12-2021,male,UNDER_GRADUATE,...,5,9,6,10,1990.00,31.00,0.00,0.00,0.00,Payday
65156,786,-31.00,34.00,1994-02-24,DISBURSED,2021-12-04,4000,04-12-2021,male,UNDER_GRADUATE,...,0,0,0,0,1994.00,27.00,0.00,0.00,4.00,Payday
65161,746,-31.00,35.00,1991-10-01,DISBURSED,2021-12-03,2000,03-12-2021,male,UNDER_GRADUATE,...,19,3,7,29,1991.00,30.00,0.00,0.00,0.00,Payday
65254,729,-36.00,39.00,1978-06-24,DISBURSED,2021-12-04,8000,04-12-2021,male,UNDER_GRADUATE,...,9,5,2,38,1978.00,43.00,0.00,0.00,1.00,Payday

In [73]:
df[df['Final status'].notnull()]

,CIBIL score,Current Loan Delay,Current Loan tenure,Date_of_birth,Final status,First Loan,Funding amount,Funding date,Gender,Highest educational qualifications,...,enquiries__past_12_months,enquiries__past_24_months,enquiries__past_30_days,enquiries__total,Year,customer_age,mths_since_first_loan,mths_since_last_loan,mths_since_last_enquiry,Binary_product
1,540,1060.00,24.00,1987-01-07,DISBURSED,2017-11-14,786531,14-11-2017,male,GRADUATE,...,23,23,7,97,1987.00,34.00,49.00,36.00,30.00,Payday
2,747,0.00,25.00,1993-11-13,FAILED,2017-11-09,352000,09-11-2017,male,POST_GRADUATE,...,38,16,0,120,1993.00,28.00,49.00,nan,6.00,Payday
3,706,5.00,29.00,1982-05-11,PAID,NaT,417000,NaN,male,GRADUATE,...,9,16,1,175,1982.00,39.00,nan,29.00,12.00,Payday
4,721,0.00,179.00,1988-01-07,DISBURSED,2017-11-30,2489500,30-11-2017,male,GRADUATE,...,10,22,1,37,1988.00,33.00,48.00,2.00,3.00,EMI
5,714,0.00,29.00,1983-02-26,FAILED,2017-08-11,995000,11-08-2017,male,POST_GRADUATE,...,71,47,0,326,1983.00,38.00,52.00,nan,21.00,Payday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65077,731,-25.00,28.00,1996-12-08,DISBURSED,2021-12-04,3000,04-12-2021,male,UNDER_GRADUATE,...,5,7,3,10,1996.00,25.00,0.00,0.00,1.00,Payday
65124,738,-31.00,34.00,1990-03-27,DISBURSED,2021-12-04,10000,04-12-2021,male,UNDER_GRADUATE,...,5,9,6,10,1990.00,31.00,0.00,0.00,0.00,Payday
65156,786,-31.00,34.00,1994-02-24,DISBURSED,2021-12-04,4000,04-12-2021,male,UNDER_GRADUATE,...,0,0,0,0,1994.00,27.00,0.00,0.00,4.00,Payday
65161,746,-31.00,35.00,1991-10-01,DISBURSED,2021-12-03,2000,03-12-2021,male,UNDER_GRADUATE,...,19,3,7,29,1991.00,30.00,0.00,0.00,0.00,Payday
65254,729,-36.00,39.00,1978-06-24,DISBURSED,2021-12-04,8000,04-12-2021,male,UNDER_GRADUATE,...,9,5,2,38,1978.00,43.00,0.00,0.00,1.00,Payday

In [70]:
#df = df.drop(['Date_of_birth','First Loan', 'first_loan_date', 'Last Loan','last_loan_date','Purpose of loan',
     #         'enquiries__last_enquiry_date'], axis = 1)
df.columns

Index(['CIBIL score', 'Current Loan Delay', 'Current Loan tenure',
       'Date_of_birth', 'Final status', 'First Loan', 'Funding amount',
       'Funding date', 'Gender', 'Highest educational qualifications',
       'Home ownership', 'Last Loan', 'Monthly salary', 'Product/loan type',
       'Purpose of loan', 'Years Of Experience', 'user', 'Funded/Rejected',
       'accounts_summary__current_loan_balance', 'accounts_summary__overdue',
       'accounts_summary__overdue_balance',
       'accounts_summary__sanction_amount', 'accounts_summary__total_loan',
       'accounts_summary__zero_balance', 'enquiries__last_enquiry_date',
       'enquiries__past_12_months', 'enquiries__past_24_months',
       'enquiries__past_30_days', 'enquiries__total', 'Year', 'customer_age',
       'mths_since_first_loan', 'mths_since_last_loan',
       'mths_since_last_enquiry', 'Binary_product'],
      dtype='object')